bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#include <WiFiUdp.h>
#include <Arduino_SNMP_Manager.h>
#include <regex.h>
#include <time.h>
#include <esp_random.h>
#include <ElegantOTA.h>

// MeshCore layered protocol implementation
#include "MeshCore.hpp"

#include "config.hpp"

// --- LCD and Touch Screen Support (Conditional) ---
// Define HAS_LCD=1 in build flags to enable LCD/touch support
// This is enabled for boards like the Guition ESP32-4848S040
#ifdef HAS_LCD
#define LGFX_USE_V1
#include <LovyanGFX.hpp>
#include <lgfx/v1/platforms/esp32s3/Panel_RGB.hpp>
#include <lgfx/v1/platforms/esp32s3/Bus_RGB.hpp>

// --- Display and touch configuration for ESP32-4848S040 ---
#ifndef TFT_WIDTH
#define TFT_WIDTH 480
#endif

#ifndef TFT_HEIGHT
#define TFT_HEIGHT 480
#endif

#ifndef TFT_SCLK_PIN
#define TFT_SCLK_PIN 48  // SPI clock for ST7701 initialization
#endif

#ifndef TFT_MOSI_PIN
#define TFT_MOSI_PIN 47  // SPI data for ST7701 initialization
#endif

#ifndef TFT_MISO_PIN
#define TFT_MISO_PIN -1
#endif

#ifndef TFT_CS_PIN
#define TFT_CS_PIN 39   // LCD_CS per pinout (IO39)
#endif

#ifndef TFT_DC_PIN
#define TFT_DC_PIN 9
#endif

#ifndef TFT_RST_PIN
#define TFT_RST_PIN -1  // No hardware reset pin - uses software reset via SPI init
#endif

#ifndef TFT_BL_PIN
#define TFT_BL_PIN 38   // Backlight control pin
#endif

#ifndef TOUCH_SDA_PIN
#define TOUCH_SDA_PIN 19  // Touch I2C SDA
#endif

#ifndef TOUCH_SCL_PIN
#define TOUCH_SCL_PIN 45  // Touch I2C SCL
#endif

#ifndef TOUCH_INT_PIN
#define TOUCH_INT_PIN 40  // Touch interrupt pin
#endif

#ifndef TOUCH_RST_PIN
// Touch reset pin - Hardware design note:
// GPIO 38 is shared between touch reset and backlight control on this board.
// The GT911 touch controller requires a reset pulse during initialization,
// after which the pin is reconfigured for PWM backlight control by LovyanGFX.
#define TOUCH_RST_PIN 38
#endif

// LGFX device configured for ST7701 parallel RGB (16-bit)
class LGFX : public lgfx::LGFX_Device {
  lgfx::Bus_RGB _bus_instance;
  lgfx::Panel_ST7701_guition_esp32_4848S040 _panel_instance;
  lgfx::Light_PWM _light_instance;
  lgfx::Touch_GT911 _touch_instance;

 public:
  LGFX() {
    // Panel configuration
    {
      auto cfg = _panel_instance.config();
      cfg.memory_width  = TFT_WIDTH;
      cfg.memory_height = TFT_HEIGHT;
      cfg.panel_width   = TFT_WIDTH;
      cfg.panel_height  = TFT_HEIGHT;
      cfg.offset_x = 0;
      cfg.offset_y = 0;
      cfg.pin_rst = TFT_RST_PIN;
      _panel_instance.config(cfg);
    }

    // Panel detail configuration (SPI pins for ST7701 initialization)
    {
      auto cfg = _panel_instance.config_detail();
      cfg.pin_cs   = TFT_CS_PIN;
      cfg.pin_sclk = TFT_SCLK_PIN;
      cfg.pin_mosi = TFT_MOSI_PIN;
      _panel_instance.config_detail(cfg);
    }

    // RGB Bus configuration
    {
      auto cfg = _bus_instance.config();
      cfg.panel = &_panel_instance;
      // Data pins d0..d15 mapped for ESP32-4848S040
      cfg.pin_d0  = GPIO_NUM_4;   // DB1(B)  -> IO4
      cfg.pin_d1  = GPIO_NUM_5;   // DB2(B)  -> IO5
      cfg.pin_d2  = GPIO_NUM_6;   // DB3(B)  -> IO6
      cfg.pin_d3  = GPIO_NUM_7;   // DB4(B)  -> IO7
      cfg.pin_d4  = GPIO_NUM_15;  // DB5(B)  -> IO15
      cfg.pin_d5  = GPIO_NUM_8;   // DB6(G)  -> IO8
      cfg.pin_d6  = GPIO_NUM_20;  // DB7(G)  -> IO20
      cfg.pin_d7  = GPIO_NUM_3;   // DB8(G)  -> IO3
      cfg.pin_d8  = GPIO_NUM_46;  // DB9(G)  -> IO46
      cfg.pin_d9  = GPIO_NUM_9;   // DB10(G) -> IO9
      cfg.pin_d10 = GPIO_NUM_10;  // DB11(R) -> IO10
      cfg.pin_d11 = GPIO_NUM_11;  // DB13(R) -> IO11
      cfg.pin_d12 = GPIO_NUM_12;  // DB14(R) -> IO12
      cfg.pin_d13 = GPIO_NUM_13;  // DB15(R) -> IO13
      cfg.pin_d14 = GPIO_NUM_14;  // DB16(R) -> IO14
      cfg.pin_d15 = GPIO_NUM_0;   // DB17(R) -> IO0

      // Control / timing pins
      cfg.pin_henable = GPIO_NUM_18;  // DE    -> IO18
      cfg.pin_vsync   = GPIO_NUM_17;  // VSYNC -> IO17
      cfg.pin_hsync   = GPIO_NUM_16;  // HSYNC -> IO16
      cfg.pin_pclk    = GPIO_NUM_21;  // PCLK  -> IO21

      cfg.freq_write = 16000000; // 16MHz for RGB bus

      // Timing parameters for ST7701 display
      cfg.hsync_polarity    = 0;
      cfg.hsync_front_porch = 8;
      cfg.hsync_pulse_width = 4;
      cfg.hsync_back_porch  = 8;
      cfg.vsync_polarity    = 0;
      cfg.vsync_front_porch = 8;
      cfg.vsync_pulse_width = 4;
      cfg.vsync_back_porch  = 8;
      cfg.pclk_idle_high    = 0;
      cfg.de_idle_high      = 0;

      _bus_instance.config(cfg);
    }
    _panel_instance.setBus(&_bus_instance);

    // Backlight (PWM)
    {
      auto cfg = _light_instance.config();
      cfg.pin_bl = TFT_BL_PIN;
      _light_instance.config(cfg);
    }
    _panel_instance.light(&_light_instance);

    // GT911 Touch controller configuration
    // Note: pin_rst is set to -1 to prevent LovyanGFX from performing a second reset.
    // The GT911's I2C address is determined by the INT pin state during reset, and
    // we perform a manual reset with proper INT pin state in initDisplay() before
    // calling display.init(). If LovyanGFX performs its own reset, it doesn't set
    // the INT pin correctly, potentially causing the wrong I2C address to be selected.
    {
      auto cfg = _touch_instance.config();
      cfg.x_min = 0;
      cfg.x_max = TFT_WIDTH - 1;
      cfg.y_min = 0;
      cfg.y_max = TFT_HEIGHT - 1;
      cfg.pin_int = TOUCH_INT_PIN;
      cfg.pin_rst = -1;  // Disable LGFX reset - we do manual reset in initDisplay()
      cfg.bus_shared = false;
      cfg.offset_rotation = 0;
      cfg.i2c_port = 1;
      cfg.i2c_addr = 0x14;  // GT911 address when INT is HIGH during reset
      cfg.pin_sda = TOUCH_SDA_PIN;
      cfg.pin_scl = TOUCH_SCL_PIN;
      cfg.freq = 400000;
      _touch_instance.config(cfg);
      _panel_instance.setTouch(&_touch_instance);
    }

    setPanel(&_panel_instance);
  }
};

// LCD display instance and state variables
static LGFX display;
static bool displayReady = false;
static bool touchReady = false;
static int currentServiceIndex = 0;  // Used for detail view
static bool displayNeedsUpdate = true;
static unsigned long lastTouchTime = 0;
static const unsigned long TOUCH_DEBOUNCE_MS = 300;  // Debounce interval for touch input

// Display view state machine
enum DisplayView {
  VIEW_MAIN,      // Main view showing all services as buttons
  VIEW_DETAIL,    // Detail view showing one service's information
  VIEW_SETTINGS,  // Settings modal for screen timeout configuration
  VIEW_OFF        // Screen is off (backlight off)
};

static DisplayView currentView = VIEW_MAIN;

// Screen timeout and power management
static unsigned long lastActivityTime = 0;       // Last user interaction time
static unsigned long screenTimeoutMs = 60000;    // Default 60 seconds timeout (0 = disabled)
static const unsigned long MIN_TIMEOUT_MS = 10000;   // Minimum 10 seconds
static const unsigned long MAX_TIMEOUT_MS = 600000;  // Maximum 10 minutes
static const char* SCREEN_TIMEOUT_FILE = "/screen_timeout.txt";

// Power button state for long-press detection
static unsigned long powerButtonPressStart = 0;
static bool powerButtonPressed = false;
static const unsigned long POWER_BUTTON_HOLD_MS = 1000;  // Hold for 1 second to open settings

// Double-tap detection for wake
static unsigned long lastTapTime = 0;
static const unsigned long DOUBLE_TAP_WINDOW_MS = 500;  // Time window for double-tap

