bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      int failThreshold = doc["failThreshold"] | 1;
      if (failThreshold < 1) failThreshold = 1;
      newService.failThreshold = failThreshold;

      int rearmCount = doc["rearmCount"] | 0;
      if (rearmCount < 0) rearmCount = 0;
      newService.rearmCount = rearmCount;

      // SNMP-specific fields
      newService.snmpOid = doc["snmpOid"] | "";
      newService.snmpCommunity = doc["snmpCommunity"] | "public";
      String compareOpStr = doc["snmpCompareOp"] | "=";
      newService.snmpCompareOp = parseSnmpCompareOp(compareOpStr);
      newService.snmpExpectedValue = doc["snmpExpectedValue"] | "";

      // Push-specific fields
      if (newService.type == TYPE_PUSH) {
        newService.pushToken = generatePushToken();
      } else {
        newService.pushToken = "";
      }
      newService.lastPush = 0;

      newService.consecutivePasses = 0;
      newService.consecutiveFails = 0;
      newService.failedChecksSinceAlert = 0;
      newService.isUp = false;
      newService.hasBeenUp = false;
      newService.lastCheck = 0;
      newService.lastUptime = 0;
      newService.lastError = "";
      newService.secondsSinceLastCheck = -1;
      // Enable/disable and pause fields
      newService.enabled = true;
      newService.pauseUntil = 0;

      services[serviceCount++] = newService;
      saveServices();

      JsonDocument response;
      response["success"] = true;
      response["id"] = newService.id;
      if (newService.type == TYPE_PUSH) {
        response["pushToken"] = newService.pushToken;
      }

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  // delete service
  server.on("/api/services/*", HTTP_DELETE, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    String path = request->url();
    String serviceId = path.substring(path.lastIndexOf('/') + 1);

    int foundIndex = -1;
    for (int i = 0; i < serviceCount; i++) {
      if (services[i].id == serviceId) {
        foundIndex = i;
        break;
      }
    }

    if (foundIndex == -1) {
      request->send(404, "application/json", "{\"error\":\"Service not found\"}");
      return;
    }

    // Shift services array
    for (int i = foundIndex; i < serviceCount - 1; i++) {
      services[i] = services[i + 1];
    }
    serviceCount--;

    saveServices();
    request->send(200, "application/json", "{\"success\":true}");
  });

  // update service (enable/disable/pause)
  server.on("/api/services/*", HTTP_PATCH, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      // Extract service ID from URL path
      String path = request->url();
      String serviceId = path.substring(path.lastIndexOf('/') + 1);

      // Find the service
      int foundIndex = -1;
      for (int i = 0; i < serviceCount; i++) {
        if (services[i].id == serviceId) {
          foundIndex = i;
          break;
        }
      }

      if (foundIndex == -1) {
        request->send(404, "application/json", "{\"error\":\"Service not found\"}");
        return;
      }

      JsonDocument doc;
      if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      // Update enabled status if provided
      if (!doc["enabled"].isNull()) {
        services[foundIndex].enabled = doc["enabled"].as<bool>();
        Serial.printf("Service '%s' enabled set to %s\n", 
                      services[foundIndex].name.c_str(),
                      services[foundIndex].enabled ? "true" : "false");
      }

      // Update pause duration if provided (in seconds, 0 to unpause)
      if (!doc["pauseDuration"].isNull()) {
        int pauseDuration = doc["pauseDuration"].as<int>();
        if (pauseDuration > 0) {
          // Limit pause duration to prevent overflow (MAX_PAUSE_DURATION_SECONDS * 1000 fits in unsigned long)
          if (pauseDuration > MAX_PAUSE_DURATION_SECONDS) {
            pauseDuration = MAX_PAUSE_DURATION_SECONDS;
          }
          // Calculate pause end time - safe because pauseDuration is limited
          unsigned long durationMs = static_cast<unsigned long>(pauseDuration) * 1000UL;
          services[foundIndex].pauseUntil = millis() + durationMs;
          Serial.printf("Service '%s' paused for %d seconds\n", 
                        services[foundIndex].name.c_str(), pauseDuration);
        } else {
          services[foundIndex].pauseUntil = 0;
          Serial.printf("Service '%s' unpaused\n", services[foundIndex].name.c_str());
        }
      }

      saveServices();

      // Build response with current state (rollover-safe)
      unsigned long currentTimeMs = millis();
      JsonDocument response;
      response["success"] = true;
      response["id"] = services[foundIndex].id;
      response["enabled"] = services[foundIndex].enabled;
      response["pauseUntil"] = services[foundIndex].pauseUntil;
      response["pauseRemaining"] = getPauseRemainingMs(services[foundIndex].pauseUntil, currentTimeMs) / 1000;

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  // export services configuration
  server.on("/api/export", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    for (int i = 0; i < serviceCount; i++) {
      JsonObject obj = array.add<JsonObject>();
      obj["name"] = services[i].name;
      obj["type"] = getServiceTypeString(services[i].type);
      obj["host"] = services[i].host;
      obj["port"] = services[i].port;
      obj["path"] = services[i].path;
      obj["url"] = services[i].url;
      obj["expectedResponse"] = services[i].expectedResponse;
      obj["checkInterval"] = services[i].checkInterval;
      obj["passThreshold"] = services[i].passThreshold;
      obj["failThreshold"] = services[i].failThreshold;
      obj["rearmCount"] = services[i].rearmCount;
      // SNMP-specific fields
      obj["snmpOid"] = services[i].snmpOid;
      obj["snmpCommunity"] = services[i].snmpCommunity;
      obj["snmpCompareOp"] = getSnmpCompareOpString(services[i].snmpCompareOp);
      obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
      // Push-specific fields (token is regenerated on import for security)
      // We don't export the token, just the type
    }

    String response;
    serializeJson(doc, response);

    AsyncWebServerResponse *res = request->beginResponse(200, "application/json", response);
    res->addHeader("Content-Disposition", "attachment; filename=\"monitors-backup.json\"");
    request->send(res);
  });

