bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    if (!found) {
      request->send(404, "application/json", "{\"error\":\"Invalid push token\"}");
    }
  });

  // Initialize ElegantOTA for firmware updates via web interface
  // Access the update page at /update
  // Use existing web authentication credentials if configured
  if (strlen(WEB_AUTH_USERNAME) > 0 && strlen(WEB_AUTH_PASSWORD) > 0) {
    ElegantOTA.begin(&server, WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD);
  } else {
    ElegantOTA.begin(&server);
  }
  
  server.begin();
  Serial.println("Web server started");
  Serial.println("OTA update available at: http://<ip>/update");
}

String generateServiceId() {
  return String(millis()) + String(random(1000, 9999));
}

String generatePushToken() {
  // Generate a 16-character hex token for push endpoints
  // Uses ESP32's hardware random number generator for better entropy
  String token = "";
  const char hexChars[] = "0123456789abcdef";
  for (int i = 0; i < 16; i++) {
    token += hexChars[esp_random() % 16];
  }
  return token;
}

void checkServices() {
  // Skip all network-dependent checks if WiFi is not connected
  // This prevents crashes from network operations when WiFi is unavailable
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  unsigned long currentTime = millis();

#ifdef HAS_LCD
  bool anyServiceChecked = false;  // Track if any service was checked this cycle
#endif

  for (int i = 0; i < serviceCount; i++) {
    // Skip disabled services
    if (!services[i].enabled) {
      continue;
    }

    // Skip paused services (using rollover-safe helper function)
    if (services[i].pauseUntil > 0) {
      unsigned long remaining = getPauseRemainingMs(services[i].pauseUntil, currentTime);
      if (remaining > 0) {
        continue;  // Pause is still active
      }
      // Pause has expired or rollover detected - clear it
      services[i].pauseUntil = 0;
    }

    // Check if it's time to check this service
    if (currentTime - services[i].lastCheck < services[i].checkInterval * 1000) {
      continue;
    }

    services[i].lastCheck = currentTime;
    bool wasUp = services[i].isUp;

#ifdef HAS_LCD
    anyServiceChecked = true;  // Mark that at least one service was checked
#endif

    // Perform the actual check
    bool checkResult = false;
    switch (services[i].type) {
      case TYPE_HTTP_GET:
        checkResult = checkHttpGet(services[i]);
        break;
      case TYPE_PING:
        checkResult = checkPing(services[i]);
        break;
      case TYPE_SNMP_GET:
        checkResult = checkSnmpGet(services[i]);
        break;
      case TYPE_PORT:
        checkResult = checkPort(services[i]);
        break;
      case TYPE_PUSH:
        checkResult = checkPush(services[i]);
        break;
    }

    // Update consecutive counters based on check result
    if (checkResult) {
      services[i].consecutivePasses++;
      services[i].consecutiveFails = 0;
      services[i].lastUptime = currentTime;
      services[i].lastError = "";
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on success
    } else {
      services[i].consecutiveFails++;
      services[i].consecutivePasses = 0;
    }

    // Determine new state based on thresholds
    if (!services[i].isUp && services[i].consecutivePasses >= services[i].passThreshold) {
      // Service has passed enough times to be considered UP
      services[i].isUp = true;
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on recovery
    } else if (services[i].isUp && services[i].consecutiveFails >= services[i].failThreshold) {
      // Service has failed enough times to be considered DOWN
      services[i].isUp = false;
    }

    // Log and notify on state changes
    if (wasUp != services[i].isUp) {
      Serial.printf("Service '%s' is now %s (after %d consecutive %s)\n",
        services[i].name.c_str(),
        services[i].isUp ? "UP" : "DOWN",
        services[i].isUp ? services[i].consecutivePasses : services[i].consecutiveFails,
        services[i].isUp ? "passes" : "fails");

#ifdef HAS_LCD
      // Set display update flag BEFORE notifications to ensure display refreshes
      // even if notification operations take a long time or encounter errors
      displayNeedsUpdate = true;
#endif

      if (!services[i].isUp) {
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after initial alert
      } else if (services[i].hasBeenUp) {
        // Only send online notification if service was previously UP (not initial UP after boot)
        sendOnlineNotification(services[i]);
      }
      
      // Mark that service has been UP at least once (for initial UP notification suppression)
      if (services[i].isUp) {
        services[i].hasBeenUp = true;
      }
    } else if (!services[i].isUp && !checkResult && services[i].rearmCount > 0) {
      // Service is still DOWN and check failed - handle re-arm logic
      services[i].failedChecksSinceAlert++;
      if (services[i].failedChecksSinceAlert >= services[i].rearmCount) {
        Serial.printf("Service '%s' still DOWN - re-arming alert after %d failed checks\n",
          services[i].name.c_str(), services[i].failedChecksSinceAlert);
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after re-arm alert
      }
    }

#ifdef HAS_LCD
    // Update display if viewing detail view and this specific service was checked
    if (currentView == VIEW_DETAIL && i == currentServiceIndex) {
      displayNeedsUpdate = true;
    }
#endif
  }

#ifdef HAS_LCD
  // Update display if in main view and any service was checked
  // This is done once outside the loop to avoid redundant flag setting
  if (currentView == VIEW_MAIN && anyServiceChecked) {
    displayNeedsUpdate = true;
  }
#endif
}

// Helper function to match text against a POSIX extended regex pattern
// Returns 0 on match, 1 on no match, -1 on pattern too long, -2 on invalid pattern
int matchesRegex(const String& text, const String& pattern) {
  // Limit pattern length to prevent excessive resource usage
  if (pattern.length() > MAX_REGEX_PATTERN_LENGTH) {
    return -1;
  }
  
  regex_t regex;
  int result;
  
  // Compile the regex pattern with extended syntax
  result = regcomp(&regex, pattern.c_str(), REG_EXTENDED | REG_NOSUB);
  if (result != 0) {
    // Pattern compilation failed - do not call regfree() on failed compile
    return -2;
  }
  
  // Execute the regex match
  result = regexec(&regex, text.c_str(), 0, NULL, 0);
  regfree(&regex);
  
  return result == 0 ? 0 : 1;  // 0 = match, 1 = no match
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  
  // Use the URL field directly - supports both HTTP and HTTPS
  String url = service.url;
  
