bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (serializeJson(doc, file) == 0) {
    Serial.println("Failed to serialize services.json");
  }
  file.close();
  Serial.println("Services saved");
}

void loadServices() {
  File file = LittleFS.open("/services.json", "r");
  if (!file) {
    Serial.println("No services.json found, starting fresh");
    return;
  }

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();

  if (error) {
    Serial.println("Failed to parse services.json");
    return;
  }

  JsonArray array = doc["services"];
  serviceCount = 0;

  for (JsonObject obj : array) {
    if (serviceCount >= MAX_SERVICES) break;

    services[serviceCount].id = obj["id"].as<String>();
    services[serviceCount].name = obj["name"].as<String>();
    services[serviceCount].type = (ServiceType)obj["type"].as<int>();
    services[serviceCount].host = obj["host"].as<String>();
    services[serviceCount].port = obj["port"];
    services[serviceCount].path = obj["path"].as<String>();
    services[serviceCount].url = obj["url"] | "";
    // Backward compatibility: generate URL from host/port/path if URL is empty
    if (services[serviceCount].url.length() == 0 && 
        services[serviceCount].type == TYPE_HTTP_GET &&
        services[serviceCount].host.length() > 0) {
      // Use HTTPS if port is 443, otherwise use HTTP
      String protocol = (services[serviceCount].port == 443) ? "https://" : "http://";
      services[serviceCount].url = protocol + services[serviceCount].host + 
                                   ":" + String(services[serviceCount].port) + 
                                   services[serviceCount].path;
    }
    services[serviceCount].expectedResponse = obj["expectedResponse"].as<String>();
    services[serviceCount].checkInterval = obj["checkInterval"];
    services[serviceCount].passThreshold = obj["passThreshold"] | 1;
    services[serviceCount].failThreshold = obj["failThreshold"] | 1;
    services[serviceCount].rearmCount = obj["rearmCount"] | 0;
    // SNMP-specific fields
    services[serviceCount].snmpOid = obj["snmpOid"] | "";
    services[serviceCount].snmpCommunity = obj["snmpCommunity"] | "public";
    services[serviceCount].snmpCompareOp = (SnmpCompareOp)(obj["snmpCompareOp"].as<int>());
    services[serviceCount].snmpExpectedValue = obj["snmpExpectedValue"] | "";
    // Push-specific fields
    services[serviceCount].pushToken = obj["pushToken"] | "";
    services[serviceCount].lastPush = 0;
    services[serviceCount].consecutivePasses = 0;
    services[serviceCount].consecutiveFails = 0;
    services[serviceCount].failedChecksSinceAlert = 0;
    services[serviceCount].isUp = false;
    services[serviceCount].hasBeenUp = false;
    services[serviceCount].lastCheck = 0;
    services[serviceCount].lastUptime = 0;
    services[serviceCount].lastError = "";
    services[serviceCount].secondsSinceLastCheck = -1;
    // Enable/disable and pause fields
    services[serviceCount].enabled = obj["enabled"] | true;  // Default to enabled
    services[serviceCount].pauseUntil = obj["pauseUntil"] | 0;

    serviceCount++;
  }

  Serial.printf("Loaded %d services\n", serviceCount);
}

String getServiceTypeString(ServiceType type) {
  switch (type) {
    case TYPE_HTTP_GET: return "http_get";
    case TYPE_PING: return "ping";
    case TYPE_SNMP_GET: return "snmp_get";
    case TYPE_PORT: return "port";
    case TYPE_PUSH: return "push";
    default: return "unknown";
  }
}

// --- LCD and Touch Screen Functions (Conditional) ---
#ifdef HAS_LCD

// Record user activity for screen timeout
void recordActivity() {
  lastActivityTime = millis();
}

// Load screen timeout setting from LittleFS
void loadScreenTimeout() {
  File file = LittleFS.open(SCREEN_TIMEOUT_FILE, "r");
  if (!file) {
    Serial.println("No screen timeout setting found, using default");
    return;
  }
  
  String timeoutStr = file.readStringUntil('\n');
  file.close();
  
  unsigned long timeout = timeoutStr.toInt();
  if (timeout == 0 || (timeout >= MIN_TIMEOUT_SECONDS && timeout <= MAX_TIMEOUT_SECONDS)) {
    screenTimeoutMs = timeout * 1000;
    // Find matching index for settings UI
    for (int i = 0; i < TIMEOUT_OPTIONS_COUNT; i++) {
      if (TIMEOUT_OPTIONS[i] == (int)(timeout)) {
        selectedTimeoutIndex = i;
        break;
      }
    }
    Serial.printf("Loaded screen timeout: %lu seconds\n", timeout);
  }
}

// Save screen timeout setting to LittleFS
void saveScreenTimeout() {
  File file = LittleFS.open(SCREEN_TIMEOUT_FILE, "w");
  if (!file) {
    Serial.println("Failed to save screen timeout setting");
    return;
  }
  
  file.println(screenTimeoutMs / 1000);
  file.close();
  Serial.printf("Saved screen timeout: %lu seconds\n", screenTimeoutMs / 1000);
}

// Turn screen off (backlight off)
void turnScreenOff() {
  if (!displayReady) return;
  display.setBrightness(0);
  currentView = VIEW_OFF;
  Serial.println("Screen turned off");
}

// Turn screen on (restore backlight)
void turnScreenOn() {
  if (!displayReady) return;
  display.setBrightness(200);
  currentView = VIEW_MAIN;
  recordActivity();
  displayNeedsUpdate = true;
  Serial.println("Screen turned on");
}

void initDisplay() {
  Serial.println("Initializing display...");
  
  // Reset the GT911 touch controller with proper I2C address selection.
  // The GT911 I2C address is determined by the state of the INT pin during the
  // rising edge of RST:
  //   - INT HIGH during RST rise -> address 0x14
  //   - INT LOW during RST rise -> address 0x5D
  // Hardware note: On ESP32-4848S040, GPIO 38 is shared between touch reset and backlight.
  // After reset, LovyanGFX reconfigures this pin for PWM backlight control.
  if (TOUCH_RST_PIN >= 0) {
    // Configure INT pin as output and set HIGH to select address 0x14
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, OUTPUT);
      digitalWrite(TOUCH_INT_PIN, HIGH);
      delay(1);  // Ensure INT state is stable before reset sequence
    }
    
    // Perform reset sequence
    pinMode(TOUCH_RST_PIN, OUTPUT);
    digitalWrite(TOUCH_RST_PIN, LOW);
    delay(10);  // GT911 requires minimum 10ms reset pulse
    digitalWrite(TOUCH_RST_PIN, HIGH);
    delay(50);  // Wait for GT911 address latch and internal initialization
    
    // Release INT pin for normal interrupt operation
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, INPUT);
    }
    
    Serial.println("GT911 touch controller reset complete (address 0x14)");
  }
  
  displayReady = display.init();
  display.setRotation(0);  // Rotation 0 for ESP32-4848S040 square display
  display.setTextSize(2);
  display.setTextColor(TFT_WHITE, TFT_BLACK);

  if (TFT_BL_PIN >= 0) {
    display.setBrightness(200);
  }

  // Touch controller is initialized as part of the LGFX class (GT911)
  touchReady = display.touch() != nullptr;

