bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (touchReady) {
    Serial.println("Touch controller (GT911) ready");
  } else {
    Serial.println("Touch controller not detected");
  }

  if (displayReady) {
    // Load saved screen timeout setting
    loadScreenTimeout();
    
    display.startWrite();
    display.fillScreen(TFT_BLACK);
    display.endWrite();
    currentView = VIEW_MAIN;
    recordActivity();
    displayNeedsUpdate = true;
    Serial.println("Display initialized successfully");
  } else {
    Serial.println("Display initialization failed");
  }
}

// Draw the header with title and power button
void drawHeader() {
  int16_t width = display.width();
  
  // Header background
  display.fillRect(0, 0, width, HEADER_HEIGHT, TFT_NAVY);
  
  // Title
  display.setTextColor(TFT_CYAN, TFT_NAVY);
  display.setTextSize(2);
  display.setCursor(10, 15);
  display.print("ESP32 Monitor");
  
  // WiFi status
  if (WiFi.status() == WL_CONNECTED) {
    display.setTextColor(TFT_WHITE, TFT_NAVY);
    display.setCursor(10, 32);
    display.setTextSize(1);
    display.print(WiFi.localIP().toString());
  }
  
  // Power button (top right)
  int powerBtnX = width - POWER_BUTTON_SIZE - 5;
  int powerBtnY = 5;
  display.fillRoundRect(powerBtnX, powerBtnY, POWER_BUTTON_SIZE, POWER_BUTTON_SIZE, 8, TFT_DARKGREY);
  display.drawRoundRect(powerBtnX, powerBtnY, POWER_BUTTON_SIZE, POWER_BUTTON_SIZE, 8, TFT_WHITE);
  
  // Power icon (simple circle with line)
  int iconCenterX = powerBtnX + POWER_BUTTON_SIZE / 2;
  int iconCenterY = powerBtnY + POWER_BUTTON_SIZE / 2;
  display.drawCircle(iconCenterX, iconCenterY, 10, TFT_WHITE);
  display.fillRect(iconCenterX - 2, iconCenterY - 12, 4, 10, TFT_WHITE);
}

// Get status color for a service
uint16_t getServiceStatusColor(const Service& svc) {
  if (!svc.enabled) {
    return TFT_DARKGREY;
  }
  if (svc.pauseUntil > 0 && getPauseRemainingMs(svc.pauseUntil, millis()) > 0) {
    return TFT_ORANGE;
  }
  if (svc.lastCheck == 0) {
    return TFT_BLUE;  // Pending
  }
  return svc.isUp ? TFT_GREEN : TFT_RED;
}

// Render main view showing all services as buttons
void renderMainView() {
  if (!displayReady) return;

  display.startWrite();
  display.fillScreen(TFT_BLACK);
  
  int16_t width = display.width();
  int16_t height = display.height();

  // Draw header
  drawHeader();

  // Show message if no services configured
  if (serviceCount == 0) {
    display.setCursor(10, HEADER_HEIGHT + 20);
    display.setTextColor(TFT_WHITE, TFT_BLACK);
    display.setTextSize(2);
    display.println("No services configured.");
    display.setCursor(10, HEADER_HEIGHT + 50);
    display.println("Add services via web UI.");
    display.endWrite();
    return;
  }

  // Calculate button layout - 2 columns
  int cols = 2;
  int buttonWidth = (width - (cols + 1) * SERVICE_BUTTON_MARGIN) / cols;
  int startY = HEADER_HEIGHT + SERVICE_BUTTON_MARGIN;
  int availableHeight = height - startY - SERVICE_BUTTON_MARGIN;
  int maxRows = availableHeight / (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
  
  // Draw service buttons
  for (int i = 0; i < serviceCount && i < maxRows * cols; i++) {
    int row = i / cols;
    int col = i % cols;
    
    int btnX = SERVICE_BUTTON_MARGIN + col * (buttonWidth + SERVICE_BUTTON_MARGIN);
    int btnY = startY + row * (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
    
    Service& svc = services[i];
    uint16_t statusColor = getServiceStatusColor(svc);
    
    // Button background
    display.fillRoundRect(btnX, btnY, buttonWidth, SERVICE_BUTTON_HEIGHT, 8, TFT_DARKGREY);
    
    // Status indicator (left side colored bar)
    display.fillRoundRect(btnX, btnY, 8, SERVICE_BUTTON_HEIGHT, 4, statusColor);
    
    // Service name (truncate if too long)
    display.setTextColor(TFT_WHITE, TFT_DARKGREY);
    display.setTextSize(2);
    String name = svc.name;
    if (name.length() > 12) {
      name = name.substring(0, 10) + "..";
    }
    display.setCursor(btnX + 15, btnY + 10);
    display.print(name);
    
    // Status text
    display.setTextSize(1);
    display.setTextColor(statusColor, TFT_DARKGREY);
    display.setCursor(btnX + 15, btnY + 35);
    if (!svc.enabled) {
      display.print("DISABLED");
    } else if (svc.pauseUntil > 0 && getPauseRemainingMs(svc.pauseUntil, millis()) > 0) {
      display.print("PAUSED");
    } else if (svc.lastCheck == 0) {
      display.print("PENDING");
    } else {
      display.print(svc.isUp ? "UP" : "DOWN");
    }
  }
  
  // Show indicator if there are more services than can fit
  if (serviceCount > maxRows * cols) {
    display.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    display.setTextSize(1);
    display.setCursor(width / 2 - 40, height - 15);
    display.printf("+ %d more", serviceCount - maxRows * cols);
  }
  display.endWrite();
}

// Render detail view for a single service
void renderDetailView() {
  if (!displayReady) return;
  if (currentServiceIndex >= serviceCount) {
    currentView = VIEW_MAIN;
    displayNeedsUpdate = true;
    return;
  }

  display.startWrite();
  display.fillScreen(TFT_BLACK);
  
  int16_t width = display.width();
  int16_t height = display.height();

  Service& svc = services[currentServiceIndex];
  
  // Header with back button
  display.fillRect(0, 0, width, HEADER_HEIGHT, TFT_NAVY);
  
  // Back button
  display.fillRoundRect(5, 5, 60, POWER_BUTTON_SIZE, 8, TFT_DARKGREY);
  display.drawRoundRect(5, 5, 60, POWER_BUTTON_SIZE, 8, TFT_WHITE);
  display.setTextColor(TFT_WHITE, TFT_DARKGREY);
  display.setTextSize(2);
  display.setCursor(15, 15);
  display.print("<-");
  
  // Service name in header
  display.setTextColor(TFT_CYAN, TFT_NAVY);
  display.setCursor(75, 15);
  String headerName = svc.name;
  if (headerName.length() > 18) {
    headerName = headerName.substring(0, 16) + "..";
  }
  display.print(headerName);

  // Content area
  int contentY = HEADER_HEIGHT + 10;
  
  // Status box with large indicator
  uint16_t statusColor = getServiceStatusColor(svc);
  String statusText;
  if (!svc.enabled) {
    statusText = "DISABLED";
  } else if (svc.pauseUntil > 0 && getPauseRemainingMs(svc.pauseUntil, millis()) > 0) {
    statusText = "PAUSED";
  } else if (svc.lastCheck == 0) {
    statusText = "PENDING";
  } else {
    statusText = svc.isUp ? "UP" : "DOWN";
  }
  
  display.fillRoundRect(10, contentY, width - 20, 50, 10, statusColor);
  display.setTextColor(TFT_WHITE, statusColor);
  display.setTextSize(3);
  display.setCursor(width / 2 - statusText.length() * 9, contentY + 12);
  display.print(statusText);
  
  contentY += 60;
  
