bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
        // Delete service
        async function deleteService(id) {
            if (!confirm('Are you sure you want to delete this service?')) {
                return;
            }

            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'DELETE'
                });

                if (response.ok) {
                    showAlert('Service deleted successfully', 'success');
                    loadServices();
                } else {
                    showAlert('Failed to delete service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Toggle service enabled/disabled
        async function toggleService(id, enabled) {
            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'PATCH',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({ enabled: enabled })
                });

                if (response.ok) {
                    showAlert(`Service ${enabled ? 'enabled' : 'disabled'} successfully`, 'success');
                    loadServices();
                } else {
                    showAlert('Failed to update service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Pause service for specified duration
        async function pauseService(id, durationSeconds) {
            try {
                const response = await fetch(`/api/services/${id}`, {
                    method: 'PATCH',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({ pauseDuration: durationSeconds })
                });

                if (response.ok) {
                    if (durationSeconds > 0) {
                        const mins = Math.floor(durationSeconds / 60);
                        const secs = durationSeconds % 60;
                        const timeStr = mins > 0 ? `${mins} minute(s)` : `${secs} seconds`;
                        showAlert(`Service paused for ${timeStr}`, 'success');
                    } else {
                        showAlert('Service unpaused', 'success');
                    }
                    loadServices();
                    closePauseDialog();
                } else {
                    showAlert('Failed to update service', 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }
        }

        // Show pause duration dialog
        let currentPauseServiceId = null;
        function showPauseDialog(id) {
            currentPauseServiceId = id;
            const modal = document.createElement('div');
            modal.className = 'modal-overlay';
            modal.id = 'pauseModal';
            modal.innerHTML = `
                <div class="modal">
                    <h3>Pause Service Checks</h3>
                    <div class="pause-options">
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 300)">5 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 900)">15 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 1800)">30 minutes</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 3600)">1 hour</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 14400)">4 hours</button>
                        <button class="btn btn-secondary" onclick="pauseService('${id}', 86400)">24 hours</button>
                    </div>
                    <div class="modal-actions">
                        <button class="btn btn-secondary" onclick="closePauseDialog()">Cancel</button>
                    </div>
                </div>
            `;
            document.body.appendChild(modal);
            modal.addEventListener('click', function(e) {
                if (e.target === modal) closePauseDialog();
            });
        }

        function closePauseDialog() {
            const modal = document.getElementById('pauseModal');
            if (modal) modal.remove();
            currentPauseServiceId = null;
        }

        // Show alert
        function showAlert(message, type) {
            const container = document.getElementById('alertContainer');
            const alert = document.createElement('div');
            alert.className = `alert alert-${type}`;
            alert.textContent = message;
            container.appendChild(alert);

            setTimeout(() => {
                alert.remove();
            }, 3000);
        }

        // Export services
        function exportServices() {
            window.location.href = '/api/export';
        }

        // Import services
        async function importServices(file) {
            if (!file) return;

            try {
                const text = await file.text();
                const response = await fetch('/api/import', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: text
                });

                const result = await response.json();

                if (response.ok) {
                    showAlert(`Imported ${result.imported} service(s)` + 
                        (result.skipped > 0 ? `, skipped ${result.skipped}` : ''), 'success');
                    loadServices();
                } else {
                    showAlert('Import failed: ' + (result.error || 'Unknown error'), 'error');
                }
            } catch (error) {
                showAlert('Error: ' + error.message, 'error');
            }

            // Reset file input
            document.getElementById('importFile').value = '';
        }

        // Auto-refresh services every 5 seconds
        setInterval(loadServices, 5000);

        // Initial load
        loadServices();
        document.getElementById('serviceType').dispatchEvent(new Event('change'));
    </script>
</body>
</html>
)rawliteral";
}
